results/600w/probe/gen5_gptoss_x4/gen5_gptoss_x4__promptopt__c64__p8000.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f69e69f6f20>, trust_remote_code=True, seed=9234, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0', random_prefix_len=3072, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='gptoss', input_len=None, output_len=None, tokenizer='/workspace/models/gpt-oss-120b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['tag=gen5_gptoss_x4', 'port=8000'], result_dir='/workspace/results/probe/gen5_gptoss_x4', result_filename='gen5_gptoss_x4__promptopt__c64__p8000.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,99', goodput=None, request_id_prefix='bench-eb1e13e2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-02 23:58:16 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  9.92      
Total input tokens:                      114688    
Total generated tokens:                  8192      
Request throughput (req/s):              3.23      
Output token throughput (tok/s):         826.22    
Peak output token throughput (tok/s):    944.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          12393.26  
---------------Time to First Token----------------
Mean TTFT (ms):                          466.53    
Median TTFT (ms):                        503.92    
P50 TTFT (ms):                           503.92    
P99 TTFT (ms):                           588.11    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.59     
Median TPOT (ms):                        17.46     
P50 TPOT (ms):                           17.46     
P99 TPOT (ms):                           18.57     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.66     
Median ITL (ms):                         17.79     
P50 ITL (ms):                            17.79     
P99 ITL (ms):                            19.60     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4952.06   
Median E2EL (ms):                        4957.18   
P50 E2EL (ms):                           4957.18   
P99 E2EL (ms):                           4991.04   
==================================================